interface Person1{
    aa:string
    bb:number
}
interface Person2{
    cc:number
}
type Allperson=Person1|Person2

let fi:Allperson={
    aa:'111',
    bb:1,
    cc:11
}
// 忙的时候无心多想，闲的时候总会想这条路是否适合自己，总是困扰于一些不可逆的选择题，
// 我不擅于也不愿意去选择，往现实了去想我不能理解这个选择后面的代价差距，
// 有人说当你跳出这个维度去思考这个问题就很简单，的确。
// 我卡死在了第一步（跳出这个维度）生活在3维的世界里如何用4维的角度去思考问题，
// 我总是在做可逆的选择时很随意在做不可逆的选择敏感，可能这个不可逆是相对于现在的我来说的，

// 最近闲余的时间都用在了对幼时零散的记忆片段的拼凑，我想把它们拼接得更趋向于完整的一段，
// 长时间的回忆我渐渐发现我变得社恐，不善甚至不喜去表达，后来我发现以前的我对于选择很随意,不管这个选择的代价或者可逆性，
// 而慢慢的我在面临一些相对于我现在的不可逆的选择，犹豫，思考，对比，最后的结果好像并没有好多少，只是徒增了很多忧虑，
// 以前我感觉我是缺少对自己未来的规划，后来想想并不是，我应该是缺少在通往这个规划的途中如何将岔路摆正。

// 今天打水的时候看到保洁阿姨在和她的领导的领导抱怨，每次下班的时候某某某总是叫她等一会等一会干这干那，
// 反正你回家也是睡觉还不如在这多干一会，保洁阿姨说下班了就是俺滴自由，那是俺滴下班时间俺也需要享受生活，
// 我想不久后应该看不到这个保洁阿姨了在这内卷的社会，想想自己还不如一个阿姨活得明白，不说了到点了下班
